<template>
  <div class="notices-wrapper">
    <div class="content">
      <pre>
この利用規約（以下，「本規約」といいます。）は，TechMatch運営者（以下，「運営者」といいます。）がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。

第1条（適用）
1.本規約は，ユーザーと運営者との間の本サービスの利用に関わる一切の関係に適用されるものとします。
2.運営者は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
3.本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。

第2条（利用登録）
1.本サービスにおいては，登録希望者が本規約に同意の上，運営者の定める方法によって利用登録を申請し，運営者がこれを承認することによって，利用登録が完了するものとします。
2.運営者は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。
  1.利用登録の申請に際して虚偽の事項を届け出た場合
  2.本規約に違反したことがある者からの申請である場合
  3.その他，運営者が利用登録を相当でないと判断した場合

第3条（ユーザーIDおよびパスワードの管理）
1.ユーザーは，自己の責任において，本サービスのユーザーIDおよびパスワードを適切に管理するものとします。
2.ユーザーは，いかなる場合にも，ユーザーIDおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。運営者は，ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのユーザーIDを登録しているユーザー自身による利用とみなします。
3.ユーザーID及びパスワードが第三者によって使用されたことによって生じた損害は，運営者に故意又は重大な過失がある場合を除き，運営者は一切の責任を負わないものとします。

第4条（禁止事項）
ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。

1.法令または公序良俗に違反する行為
2.犯罪行為に関連する行為
3.本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為
4.運営者，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
5.本サービスによって得られた情報を商業的に利用する行為
6.運営者のサービスの運営を妨害するおそれのある行為
7.不正アクセスをし，またはこれを試みる行為
8.他のユーザーに関する個人情報等を収集または蓄積する行為
9.不正な目的を持って本サービスを利用する行為
10.本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為
11.他のユーザーに成りすます行為
12.運営者が許諾しない本サービス上での宣伝，広告，勧誘，または営業行為
13.面識のない異性との出会いを目的とした行為
14.運営者のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
15.その他，運営者が不適切と判断する行為

第5条（本サービスの提供の停止等）
1.運営者は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
  1.本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
  2.地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合
  3.コンピュータまたは通信回線等が事故により停止した場合
  4.その他，運営者が本サービスの提供が困難と判断した場合
2.運営者は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。

第6条（利用制限および登録抹消）
1.運営者は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。
  1.本規約のいずれかの条項に違反した場合
  2.登録事項に虚偽の事実があることが判明した場合
  3.料金等の支払債務の不履行があった場合
  4.運営者からの連絡に対し，一定期間返答がない場合
  5.本サービスについて，最終の利用から一定期間利用がない場合
  6.その他，運営者が本サービスの利用を適当でないと判断した場合
2.運営者は，本条に基づき運営者が行った行為によりユーザーに生じた損害について，一切の責任を負いません。

第7条（退会）
ユーザーは，運営者の定める退会手続により，本サービスから退会できるものとします。

第8条（保証の否認および免責事項）
1.運営者は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
2.運営者は，本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし，本サービスに関する運営者とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。
3.前項ただし書に定める場合であっても，運営者は，運営者の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（運営者またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。また，運営者の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は，ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。
4.運営者は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。

第9条（サービス内容の変更等）
運営者は，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。

第10条（利用規約の変更）
運営者は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，当該ユーザーは変更後の規約に同意したものとみなします。

第11条（個人情報の取扱い）
運営者は，本サービスの利用によって取得する個人情報については，運営者「プライバシーポリシー」に従い適切に取り扱うものとします。

第12条（通知または連絡）
ユーザーと運営者との間の通知または連絡は，運営者の定める方法によって行うものとします。運営者は,ユーザーから,運営者が別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,これらは,発信時にユーザーへ到達したものとみなします。

第13条（権利義務の譲渡の禁止）
ユーザーは，運営者の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。

第14条（準拠法・裁判管轄）
本規約の準拠法は日本法とし、本規約に起因しまたは関連する一切の紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。

第15条（定義）
本規約において使用する用語を以下に示します。
1. 「募集」とは，本サービスを利用して，ユーザが他ユーザに技術的な知識を必要とする活動の協力を要請することを意味します。
2. 「募集者」とは，本サービス内の特定の募集を登録したまたはする予定である特定のユーザを意味します。
3. 「応募」とは，本サービスを利用して，ユーザが募集に対し協力する意思を募集者に示すことを意味します。
4. 「応募者」とは，特定の応募をしたまたはする予定である特定のユーザを意味します。
5. 「マッチ」とは，本サービスを利用して，募集者が複数の応募者の中から，募集者の登録した募集に合った者を選択し，以後互いに協力的な活動をとろうと試みる意思を互いに認識することを意味します。

第16条 (募集)
1. ユーザは募集する際に本サービスの趣旨から逸れたことを目的とする募集情報を登録してはいけません。
2. 運営者は，本サービスを利用し実現したマッチ以後，募集者と応募者の間における活動については関与しません。

第17条 (応募)
募集および募集者に対し応募者が協力的な活動を試みる意思を持たない応募を禁止事項とします。

第18条 (マイページ)
1. ユーザがマイページに掲載するSNSアカウントは募集者と応募者との間における協力的な活動のための連絡手段を想定しており，これに沿わない利用は禁止事項とします。
2. 運営者はマイページに掲載されたSNSアカウントが第3者によって悪質な利用をされた場合，一切の責任を負いません。

</pre>
    </div>
    <div class="button-wrapper">
      <div
        class="button cancel is-medium"
        @click="closeNotices"
      >
        閉じる
      </div>
    </div>
  </div>
</template>

<style scoped>
</style>

<script>
export default {
    name: 'Notices',
    methods:{
        closeNotices(){
            this.$emit('closeNotices')
        }
    }
};
</script>
<style scoped>
.notices-wrapper{
    position: fixed;
    top: 2%;
    left: 10%;
    width: 80%;
    background-color: white;
    height: max-content;
    padding: 20px;
    height: 96%;
    color: black;
    border-radius: 10px;
}
.content{
    height: 95%;
    overflow-y: scroll;
}
.button-wrapper{
    text-align: center;
}
pre{
    white-space: pre-wrap;
}
</style>